Revit 2027 API
IndependentTag.RotationAngle Property
 The rotation angle of the tag relative to its view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RotationAngle { get; set; }
Public Property RotationAngle As Double
	Get
	Set
public:
property double RotationAngle {
	double get ();
	void set (double value);
}
member RotationAngle : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Angle can only be changed for AnyModelDirection orientation
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace